УТ_для_edt/src/Documents/смартЛид/смартЛид.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЛид</name>
  <comment>//++ #1543 смарт: Фролов 08.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПолученияЛида</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЛида</name>
    <type>
      <types>EnumRef.смартСостоянияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИсточника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыПоискаПоКИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегионТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>CatalogRef.Заметки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСменыОтветственного</name>
    <type>
      <types>CatalogRef.смартПричиныСменыОтветственных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределил</name>
    <comment>//++ #1835 смарт: Фролов 28.05.2024 //Доработка рабочего места секретаря</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Yclid_Метка</name>
    <comment>//++ #1941 смарт: Фролов 22.07.2024 //Добавить реквизит &quot;yclid&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ClientID</name>
    <comment>#1958 смарт: Лопато 05.08.2024 //Добавить реквизит &quot;ClientID&quot; к Лиду и Заявкам</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JSON_ИМ_Регистрация</name>
    <comment>//++ #Б-986 смарт: Фролов 23.09.2024 //ИМ. Регистрация пользователя на сайте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Roistat_visit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартКоэффициентыМенеджеров/смартКоэффициентыМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартКоэффициентыМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 15.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзменениеКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокированаВручную</name>
    <comment>//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра &quot;График отсутствия сотрудников&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/смартКвалификацииМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКвалификацииМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 10.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <predefined>
    <items>
      <name>РегистрацияПользователяНаСайте</name>
      <description>Регистрация пользователя на сайте</description>
    </items>
  </predefined>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйЭтап</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВзаимодействияСКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.смартТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПродажиВПрошлыхПеридах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЛидовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #1748 смарт: Саломадин 05.04.2024 //Переход на единую воронку</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеТоваров</name>
    <comment>//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальна</name>
    <comment>//++ #Б-4442 смарт: Фролов 30.09.2025 //Доработка механизма Квалификаций менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОценки</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификацияОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиРассылок</name>
    <comment>//++ #1738 смарт: Фролов 02.04.2024 //Добавляем дополнительных получателей рассыки по квалификации.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартЛид/Forms/ФормаПередачиДругомуОтветственному/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Ответственный = ЭтаФорма.Параметры.Ответственный;
	ЭтаФорма.ПредыдущийОтветственный = ЭтаФорма.Параметры.ПредыдущийОтветственный;
	
	ЗаполнитьСписокВыбораОтветственных();
	
	ЗаполнитьСписокВыбораПричинСменыОтветственного();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтветственных()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи 
	|ГДЕ
	|	НЕ Пользователь В
	|				(ВЫБРАТЬ
	|					Менеджер КАК Менеджер
	|				ИЗ
	|					РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних(, 
	|						ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент))
	|				ГДЕ
	|					ВыдачаЗаблокирована)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь.Наименование");
	
	Элементы.Ответственный.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь"));
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокВыбораПричинСменыОтветственного()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПричиныСменыОтветственных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Элементы.ПричинаСменыОтветственного.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.ПредыдущийОтветственный;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если ЭтаФорма.Ответственный <> ЭтаФорма.ПредыдущийОтветственный Тогда
		
		ЭтаФорма.ВладелецФормы.Объект.ПредыдущийОтветственный = ЭтаФорма.ПредыдущийОтветственный;
		ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.Ответственный;
		ЭтаФорма.ВладелецФормы.Объект.ПричинаСменыОтветственного = ЭтаФорма.ПричинаСменыОтветственного;
		
		ПодтверждениеСмены = Истина;
		
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ПодтверждениеСмены Тогда
		
		ЭтаФорма.ВладелецФормы.Объект.Ответственный = ЭтаФорма.ПредыдущийОтветственный;
		
	КонецЕсли;	
	
КонецПроцедуры
